-- =====================================================
-- Заполнение базы "Корочки.есть"
-- =====================================================

USE korochki_net;

-- -------------------------------
-- Роли
-- -------------------------------
INSERT INTO roles (id_role, role_name) VALUES
(1, 'admin'),
(2, 'user');

-- -------------------------------
-- Статусы заявок
-- -------------------------------
INSERT INTO statuses (id_status, status_name) VALUES
(1, 'Новая'),
(2, 'Идет обучение'),
(3, 'Обучение завершено');

-- -------------------------------
-- Администратор
-- -------------------------------
INSERT INTO users (
    id_user,
    last_name,
    first_name,
    middle_name,
    login,
    password_hash,
    phone,
    email,
    id_role
) VALUES
(1, 'Администратор', 'Системы', 'Главный', 'Admin', 'KorokNET', '80000000000', 'admin@korochki.ru', 1);

-- -------------------------------
-- Проверка
-- -------------------------------
SELECT 'Initial data inserted successfully!' AS status;